import re
list = "Любіть Україну, як сонце любіть, " \
       "як вітер, і трави, і води..." \
       " В годину щасливу і в радості мить," \
       " любіть у годину негоди. " \
       "Любіть Україну у сні й наяву, " \
       "вишневу свою Україну, " \
       "красу її, вічно живу і нову, " \
       "і мову її солов'їну. " \
       "Без неї — ніщо ми, як порох і дим," \
       "розвіяний в полі вітрами... " \
       "Любіть Україну всім серцем своїм" \
       "і всіми своїми ділами."
p = (re.split(",.-/. — :|\ ", list))
slovnik = { i : p.count(i) for i in p}
print(p)

print(slovnik)

print("максимальное максимальное повторений слова:", max(slovnik.values()))
print("минимальное количество повторений слова:", min(slovnik.values()))


